Revit 2025 API
RiseDropSymbol Enumeration
 This enumeration corresponds to the rise/drop symbol used in mechanical systems
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum RiseDropSymbol
Public Enumeration RiseDropSymbol
public enum class RiseDropSymbol
type RiseDropSymbol
Members
Member name | Value | Description
NoSymbol | 0 |  No rise/drop graphics will be used
Outline | 1 |  Outline only no internal geometry
Cross | 2 |  Duct supply rise/drop with X pattern
CrossFilled | 3 |  Duct supply rise/drop with X pattern and top and bottom of X is filled
Slash | 4 |  Duct return rise/drop with / pattern
SlashFilled | 5 |  Duct return rise/drop with / pattern and lower right / is filled
Backslash | 6 |  Duct return rise/drop with \ pattern
BackslashFilled | 7 |  Duct return rise/drop with \ pattern and lower left \ is filled
Wye | 8 |  Duct exhaust rise/drop with \/ pattern
ReverseWye | 9 |  Duct exhaust rise/drop with /\ pattern
CustomSymbol | -1 |  A userdefined symbol for rise/drop graphics is used
OutlineFilled | 10 |  Outline only no internal geometry and filled to be solid
YinYang | 11 |  Pipe contour rise/drop and 2 half circles (yin-yang)
YinYangFilled | 12 |  Pipe contour rise/drop and 2 half circles (yin-yang) left side is filled
BendThreeQuarterCircle | 13 |  Pipe 1 Line bend 3/4 circle
BendFullCircle | 14 |  Pipe 1 Line bend full circle
TeeHalfCircle | 15 |  Pipe 1 Line junction 1/2 circle on each side
TeeFullCircle | 16 |  Pipe 1 Line junction full circle
CrossNoOutline | 17 |  Cable Tray 1 Line a cross without outline
WyeFilled | 18 |  Duct exhaust rise/drop with \/ pattern and lower left / is filled
ReverseWyeFilled | 19 |  Duct exhaust rise/drop with /\ pattern and lower right \ is filled
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace